Repository: oscarahalvorsen/masterproject
Catalog: datacollecting/MAALFRID/tmx/udir.no.csv-en-nn.deduped.tmx
Source language: en
Languages: nn

source: This is important, not least for understanding the role of the media as a precondition for freedom of expression – and thus democracy.
nn: Dette er ikkje minst viktig for å forstå media si rolle som føresetnad for ytringsfridommen og dermed for demokratiet.

source: give an account of different media ideologies
nn: gjere greie for ulike medieideologiar

source: purchases, sales and different types of loans, and use this to formulate and solve problems
nn: ulike typar lån og bruke det til å formulere og løyse problem

source: The children especially liked searching for music on YouTube.
nn: Særleg populært blant barna var det å leite etter musikk på YouTube.

source: In the “Vitamin Garden”, we meet little Ivo Ferdinand and Iver, digging away in the dirt.
nn: I Vitaminhagen møter vi vesle Ivo Ferdinand og vesle Iver som sit og grev i jorda.

source: retrieve information from technical texts and use it to solve tasks
nn: analysere form og innhald i ulike avis-, radio-, film- og fjernsynssjangrar

source: Law comprises two programme subjects: Law 1 and Law 2.
nn: Rettslære består av to programfag: rettslære 1 og rettslære 2.

source: in Physical Education involves being able to use digital tools, different media and resources in a suitable and correct manner to solve practical tasks.
nn: i kroppsøving inneber å kunne bruke digitale verktøy, ulike medium og ressursar føremålstenleg og forsvarleg for å løyse praktiske oppgåver.

source: They are also expressed in different religions and worldviews and
nn: Dei kjem òg til uttrykk i ulike religionar og livssyn, og dei er

source: The pupils also demonstrate and develop competence when they can use knowledge and skills to solve problems and explore mathematical relationships.
nn: Elevane viser og utviklar òg kompetanse når dei får bruke kunnskap og ferdigheiter til å løyse problem og utforske matematiske samanhengar.

source: assess dietary information and advertising in the media
nn: vurdere kosthaldsinformasjon og reklame i media

source: They expected higher standards and more difficult assignments – and that there would be clear differences between kindergarten and school.
nn: Dei venta seg høgre krav og vanskelegare oppgåver – og tydelege forskjellar mellom barnehage og skole.

source: In 33 cases they used different kinds of touching to comfort the child.
nn: I 33 tilfelle brukte dei òg ulike former for berøring for å trøyste barna.

source: in Mathematics involves understanding and using symbolic language and forms of expression to create meaning from texts in day-to-day life, working life and from mathematic texts.
nn: i matematikk inneber å tolke og dra nytte av tekstar med matematisk innhald og med innhald frå daglegliv og yrkesliv.

source: It will also affect parenthood and the question about what a good childhood is,” says Schmidt.
nn: Det grip òg inn i foreldreskapet og i spørsmålet om kva som er ein god barndom, seier Schmidt.

source: used to improve kindergartens.
nn: og fremst brukast til å gjere barnehagen betre.

source: cite and evaluate sources in relevant academic situations
nn: referere til og vurdere kjelder i aktuelle faglege situasjonar

source: Being able to use and assess aids and technology and being able to recognise their limitations are important aspects of the subject.
nn: Både det å kunne bruke og vurdere hjelpemiddel og teknologi og det å kjenne til avgrensinga deira er viktige delar av faget.

source: Both the preparation and presentation of food is connected to technology and design.
nn: Både tillaging og presentasjon av mat er knytte til teknologi og design.

source: that the choice of methodology influences what we see.
nn: å studere, og at val av metode påverkar det vi ser.

source: apply rhetorical and digital skills to produce and present composite texts
nn: bruke retoriske og digitale ferdigheiter til å produsere og framføre samansette tekstar

source: discuss how the chosen challenge or conflict affects different groups
nn: drøfte korleis produksjon og distribusjon av informasjon kan bli styrt og

source: When Løvgren began this study, her hypothesis was that kindergarten teachers get emotionally exhausted at work more often than assistants because they have more work and more demanding responsibilities.
nn: Då Løvgren sette i gang med denne studien, hadde ho ein hypotese om at barnehagelærarar oftare enn assistentar blir emosjonelt utmatta av jobben, og at det var fordi dei har fleire og meir krevjande arbeidsoppgåver.

source: Exercise and lifestyle
nn: Aktivitet og livsstil

source: formulate and solve problems from one’s everyday life that are related
nn: formulere og løyse problem frå eigen kvardag som har med brøk å

source: The teaching in the subject must be adapted to and build on what each pupil has of knowledge, skills and experience so that the pupils will experience success and be motivated to use this competence in their daily lives.
nn: Opplæringa i faget må tilpassast og byggje på det den einskilde har av kunnskapar, ferdigheiter og erfaringar, slik at elevane kan lykkast og bli motiverte til å bruke kompetansen sin i dagleglivet.

source: She wanted to learn more about what engenders well-being, involvement and more physical activity among 3–5-year-olds playing outside at kindergarten.
nn: Ho ønskte å få meir kunnskap om kva som skaper trivsel, involvering og auka fysisk aktivitet hos 3–5-åringane i uteleiken i barnehagen.

source: They also demonstrate and develop competence when exploring and analysing real datasets and when making and arguing about findings.
nn: Elevane viser og utviklar òg kompetanse når dei utforskar og analyserer reelle datasett, og når dei gjer og argumenterer for funn.

source: the boundaries for freedom of speech
nn: grensene for ytringsfridommen

source: This is one of the situations Asta Cekaite and Malva Holm Kvist have analysed.
nn: Dette er ein av situasjonane Asta Cekaite og Malva Holm Kvist har analysert.

source: In 2010, the curriculum was revised, strengthening the teaching mission of preschool teachers.
nn: I 2010 vart læreplanen revidert, og læringsoppdraget til barnehagelærarane vart tydelegare.

source: discuss product information and advertising for different foods
nn: diskutere produktinformasjon og reklame for ulike matvarer

source: Mathematics shows its usefulness in practical applications and as a tool in technology and design.
nn: I arbeid med teknologi og design og i praktisk bruk viser matematikk sin nytte som reiskapsfag.

source: reflect on how ideologies and ways of thinking in the twentieth century
nn: beskrive samfunnsendringar frå antikken til tidleg nytid og vurdere

source: This scenario was excerpted from researcher Lone Svinth’s study on how children cooperate with each other.
nn: Scenen stammar frå forskar Lone Svinth og hennar undersøking av barns samarbeid.

source: Curriculum for the elective subject of living cultural heritage (LKA1-01)
nn: Læreplan i valfaget levande kulturarv (LKA1-01)

source: The ability to understand what others think, feel and experience is the basis for empathy and
nn: Å kunne setje seg inn i kva andre tenkjer, føler og erfarer, er grunnlaget for empati og

source: read a selection of contemporary texts in Bokmål and Nynorsk and discuss how these texts relate to the modern day both linguistically and thematically
nn: lese eit utval av samtidstekstar på nynorsk og bokmål og drøfte desse tekstane språkleg og tematisk i forhold til vår tid

source: knowledge and development of attitudes and competence.
nn: utvikling av haldningar og kompetanse.

source: plan, carry out and assess a personal exercising plan based on basic principles of exercising which is relevant for the skills, aptitudes and goals of the pupil
nn: planleggje, gjennomføre og vurdere ein eigentreningsperiode som byggjer på grunnleggjande prinsipp for trening og er relevant ut frå føresetnadene og måla til eleven sjølv

source: locate and document overviews of main geographic characteristics of the world and compare different countries and regions
nn: lokalisere og dokumentere oversikt over geografiske hovudtrekk i verda og samanlikne ulike land og regionar

source: express ideas about language, characters and plots in appropriate texts from different periods and cultures
nn: gje uttrykk for eigne tankar om språk, personar og handling i tekstar frå ulike tider og kulturar

source: A discussion can be ended with a conclusion.
nn: Å utforske kan bety å sanse, søke, oppdage, observere og granske.

source: education is also achieved through the experiences and practical challenges found in the
nn: opplevingar og praktiske utfordringar i undervisninga og skolekvardagen.

source: show how incidents can be presented in different manners and discuss how special interests and ideologies can cloud one’s view about what was experienced of fact and truth
nn: vise korleis hendingar kan framstillast ulikt, og drøfte korleis interesser og ideologi kan prege synet på kva som blir opplevd som fakta og sanning

source: use commutative, associative and distributive properties to explore and
nn: bruke kommutative, assosiative og distributive eigenskapar til å

source: We can talk about this with the children.
nn: Dette er noko ein kan snakke med barna om.

source: assess oral presentations given by others based on technical criteria
nn: vurdere andre sine munnlege framføringar ut frå faglege kriterium

source: Main subject areas
nn: Tal og algebra

source: experiment with different kinds of dance and compose dances
nn: gjere greie for og praktisere førebygging av og førstehjelp ved idrettsskadar

source: give an account of and differentiate between rules of law from other rules in society
nn: gjere greie for og skilje rettsreglar frå andre reglar i samfunnet

source: of belonging and cultural awareness.
nn: Språk gir oss tilhøyrsle og kulturell bevisstheit.

source: The teacher shall facilitate for pupil participation and stimulate the desire to learn by allowing the pupils to explore mathematics and solve mathematical problems by using strategies, and by being creative, reasoning and reflecting.
nn: Læraren skal leggje til rette for elevmedverknad og stimulere til lærelyst ved at elevane får utforske matematikk og løyse matematiske problem gjennom å bruke strategiar, vere kreative, resonnere og reflektere.

source: Proficiency in mathematics is thus a prerequisite for the development of society.
nn: Solid kompetanse i matematikk er dermed ein føresetnad for utvikling av samfunnet.

source: with their pupils, the teachers must promote communication and collaboration that will give
nn: lærarane fremje kommunikasjon og samarbeid som gir elevane mot og tryggleik til å ytre

source: For example, you can search for a subject, a writer, a particular research method, or a country whose research you would like to know more about.
nn: Du kan for eksempel søkje på eit emne, ein forfattar, ein spesiell forskingsmetode, eller det landet du gjerne vil sjå forsking frå.

source: history, society and working life, art and culture, and religion and worldviews.
nn: samfunn og arbeidsliv, kunst og kultur, og religion og livssyn.

source: in Physical Education means being able to measure lengths, times and forces.
nn: i kroppsøving inneber mellom anna å kunne måle lengder, tider og krefter.

source: What is the Parent Survey for kindergartens?
nn: Kva er Foreldreundersøkinga i barnehagen?

source: Through the teaching and training the pupils shall gain insight into the indigenous Sami
nn: Gjennom opplæringa skal elevane få innsikt i historia, kulturen, samfunnslivet og rettane til

source: prepare an overview of norms that regulate the relationship between people and talk about the consequences of breaking with norms
nn: lage ei oversikt over normer som regulerer forholdet mellom menneske og samtale om konsekvensar ved å bryte normene

source: teaching and training in the subjects and the overriding goals, values and principles for the
nn: og dei overordna måla, verdiane og prinsippa for opplæringa.

source: texts from 1500 to 1850 in a cultural-history context and
nn: tekstar frå 1500 til 1850 i kulturhistorisk kontekst og

source: set up and test hypotheses for gender determination and dihybrid inheritance with and without a coupling of genes
nn: setje opp og teste hypotesar for kjønnsbunden og dihybrid arvegang med og utan kopling av gen

source: Equality and equal rights are values that have been fought for throughout history and which
nn: Likeverd og likestilling er verdiar som er kjempa fram gjennom historia, og som framleis må

source: Curriculum for the elective subject of Technology in Practice (TPR1-01)
nn: Læreplan i valfaget teknologi i praksis (TPR1-01)

source: how data and personal data can be used or misused
nn: korleis data og personopplysningar kan brukast eller misbrukast

source: analyze form and content in a variety of newspaper, radio, film and TV genres
nn: analysere form og innhald i ulike avis-, radio-, film- og fjernsynssjangrar

source: Some of the results are published as statistical data at barnehagefakta.no and on Udir’s statistics pages.
nn: Delar av resultata blir publiserte som statistikk på barnehagefakta.no og på Udir sine statistikksider.

source: It also involves being able to critically assess various types of biological information in professional journals and the media.
nn: I tillegg vil det seie kritisk vurdering av ulike typar biologisk informasjon i fagtidsskrift og i media.

source: evaluate the opportunities for and challenges to establishing a company and illustrate some of the main features of the profit and loss accounts and balance sheet
nn: vurdere moglegheiter for og utfordringar ved å etablere ei bedrift og trekkje ut hovudlinene i ein resultat- og balanserekneskap

source: find examples of different types of conflicts and human rights violations and discuss and elaborate on what the United Nations and other international operators can do
nn: finne døme på ulike typar konfliktar og menneskerettsbrot og drøfte kva FN og andre internasjonale aktørar kan gjere

source: This is important for the possibilities the individual has to understand various types of natural science and technological information and shall give one the basis for participation in democratic processes in society.
nn: Faget skal gje kunnskap om korleis kroppen fungerer i aktivitet og kvile, og erfaring med korleis ein kan utvikle praktiske ferdigheiter i dei ulike aktivitetsformene.

source: define key concepts associated with socialisation and apply these to examine features of socialisation of young people in Norway
nn: definere sentrale omgrep knytte til sosialisering og bruke dei til å undersøkje og diskutere trekk ved sosialiseringa av ungdom i Noreg

source: assess and choose goods based on ethical and sustainability criteria
nn: vurdere og velje varer ut frå etiske og berekraftige kriterium

source: What impact will that have on the cooperation between families and kindergartens?
nn: Kva gjer det med ­samarbeidet mellom heim og barnehage?

source: To explore may also mean testing or trying out and evaluating work methods, products or equipment.
nn: Å utforske kan òg bety å teste eller prøve ut og evaluere arbeidsmetodar, produkt eller utstyr.

source: give an account of the fundamental principle governing the collection, filing and processing of personal information
nn: gjere greie for grunnleggjande prinsipp for innsamling, lagring og behandling av personopplysningar

source: “It is important to allow time for unstructured play.
nn: – Det er viktig at det er rom for frileik.

source: Some subjects will have
nn: Enkelte fag vil ha eit større

source: Holmberg was interested in how pedagogical documentation is used in actual practice in the day-to-day operations of ECEC centres.
nn: Holmberg var interessert i korleis pedagogisk dokumentasjon blir brukt i praksis i barnehagekvardagen.

source: In some cases, to explore means to investigate different aspects of an issue through open and critical discussion.
nn: I nokre tilfelle betyr det å undersøke ulike sider av ei sak gjennom open og kritisk drøfting.

source: in Media and information knowledge involves making use of different types of statistics as a starting point for analysis and argumentation.
nn: i medie- og informasjonskunnskap inneber å bruke ulike typar statistikkar som utgangspunkt for analyse og argumentasjon.

source: The relationship between physical activity and lifestyle based on individual interests and mastery are important topics in this area.
nn: Samanhengar mellom aktivitet og livsstil, baserte på interesser og meistring hos den einskilde, er sentrale emne på dette området.

source: practice rules for good hygiene
nn: praktisere reglar for god hygiene

source: read a representative selection of contemporary texts, fiction and non-fiction, in Bokmål and Nynorsk and in translation from Sami and then reflect on their content, form and purpose
nn: lese eit representativt utval av samtidstekstar, skjønnlitteratur og sakprosa, på nynorsk og bokmål og i omsetjing frå samisk, og reflektere over innhald, form og føremål

source: A debate among several persons on a subject can mean the same as to discuss.
nn: Ordskifte mellom fleire om eit saksforhold kan bety det same som å diskutere.

source: Being able to do arithmetic is a requirement for preparing tables and graphs and calculating distances and scales on maps.
nn: Reknedugleik er ein føresetnad for å kunne laga tabellar og grafar og rekne med avstandar og målestokk på kart.

source: use pictures, song and music in performances and presentations in Norwegian or Sign Language
nn: bruke song, musikk og bilete i framføringar og presentasjonar

source: Function and adaptation
nn: Funksjon og tilpassing

source: use digital tools to find examples of different types of conflict in the world and present an international conflict and proposals for solving this conflict
nn: bruke digitale verktøy til å finne døme på ulike typar konfliktar i verda og presentere ein aktuell internasjonal konflikt og forslag til å løyse konflikten

source: The pupils demonstrate and develop competence in Norwegian in the Vg2 programmes for general studies when they interpret texts in context and compare older and more recent texts in different media and genres.
nn: Elevane viser og utviklar kompetanse i norsk på vg2 studieførebuande utdanningsprogram når dei tolkar tekstar i kontekst og samanliknar eldre og nyare tekstar i ulike medium og sjangrar.

source: key elements and relationships in a subject, and so they can learn to apply subject
nn: samanhengar innanfor eit fag, og slik at dei lærer å bruke faglege kunnskapar og

source: However, the two are not mutually exclusive.
nn: Men det eine utelukkar ikkje det andre.

source: analyze the media as a resource and force in social and working life, and discuss open and discrete functions
nn: analysere media som ressurs og maktfaktor i samfunns- og arbeidsliv og diskutere opne og skjulte funksjonar

source: explain the reasons why there are two equal language forms and give an account of the language debates and linguistic variations in Norway in the present day
nn: forklare bakgrunnen for at det er to likestilte norske målformer, og gjere greie for språkdebatt og språkleg variasjon i Noreg i dag

source: ‘The recent graduates generally tried to fit in, adapting to current practices in the kindergarten.
nn: – Dei nyutdanna tilpassa seg i stor grad til gjeldande praksis i barnehagen.

source: use pictures, film and other sources to tell others about important landscapes and terrain formations in Norway
nn: bruke bilete, film og andre kjelder for å fortelje om viktige landskap og landskapsformer i Noreg

source: Language, literature and culture
nn: Språk, litteratur og kultur

source: Assessment of coursework
nn: grunnleggjande vilkår til å

source: Human beings are vulnerable and make mistakes.
nn: Menneske er sårbare og feilbarlege.

source: The pupils demonstrate and develop their competence in the History subject in vg3 when they use history-studies methods and material to find answers and when they understand the challenges and actions of people within historical contexts.
nn: Elevane utviklar og viser kompetanse i historie på vg3 påbygging til generell studiekompetanse når dei bruker historiefaglege metodar og historiefagleg materiale for å finne svar, og når dei forstår folks utfordringar og handlingar i historiske kontekstar.

source: And they have visited kindergartens.
nn: Og dei har besøkt barnehagar.

source: this in various ways and switch between the different representations
nn: på ulike måtar og omsetje mellom dei ulike representasjonane

source: find and present relevant social issues, distinguish between opinion and fact, formulate arguments and discuss and elaborate on the issues
nn: finne fram til og presentere aktuelle samfunnsspørsmål, skilje mellom meiningar og fakta, formulere argument og drøfte spørsmåla

source: Most tasks are performed by teachers and assistants alike.
nn: Dei fleste oppgåvene blir utførte både av barnehagelærarar og assistentar.

source: carry out experiments with chemical reactions and explain what characterises these reactions
nn: gjennomføre forsøk med lys, syn og fargar, og beskrive og forklare resultata

source: create narratives about people in the past, and thus show how frameworks and values in society influence thoughts and actions
nn: skape forteljingar om menneske i fortida, og slik vise korleis rammer og verdiar i samfunnet påverkar tankar og handlingar

source: Framework Plan for Kindergartens
nn: bruke reglane om ansvaret som barn og foreldre har

source: They often run between streams with buckets, filling them with water, then emptying them.
nn: Ofte spring dei mellom vassrennene med bøtter og heller opp og ut vatn.

source: atomic models and the periodic table to
nn: atommodellar og periodesystemet til å

source: That presented a challenge for staff.
nn: Dette var utfordrande for personalet.

source: describe and explain natural and cultural landscapes in the local community
nn: utforske, beskrive og forklare natur- og kulturlandskapet i lokalsamfunnet

source: Bearing this in mind, the subject shall provide pupils with a greater ability to think freely, from many perspectives, in a critical and tolerant way.
nn: På denne bakgrunnen skal faget gje elevane større evne til å tenkje fritt, perspektivrikt, kritisk og tolerant.

source: All pupils are different, and what
nn: Alle elevar er ulike, og kva

source: discuss the consequences for people and societies in countries and areas that were colonised
nn: brukt naturressursar, og vurdere betydninga av dette for menneske og eit berekraftig samfunn

source: They also demonstrate and develop their competence in mathematics when they reason about and argue for solutions and mathematical relationships.
nn: Vidare viser og utviklar dei kompetanse i matematikk når dei resonnerer over og argumenterer for løysingar og matematiske samanhengar.

source: cite, summarise and reflect on key points in texts and ask questions relating to the texts
nn: lese enkle tekstar på svensk og dansk og gje att og kommentere innhaldet

source: teaching and training in collaboration with the pupil and the home.
nn: tilpasse undervisninga i samarbeid med elevane og heimane.

source: That is best accomplished by talking with the children.
nn: Det å snakke om noko er eit verkemiddel for danning.

source: The teaching in social studies shall focus on natural and man-made conditions on earth.
nn: Opplæringa i samfunnsfag skal setje søkjelyset på naturlege og menneskeskapte forhold på jorda.
